* lua docs

** data type

#+begin_quote
1 nil

Used to differentiate the value from having some data or no(nil) data.

2 boolean

Includes true and false as values. Generally used for condition checking.

3 number

Represents real(double precision floating point) numbers.

4 string

Represents array of characters.

5 function

Represents a method that is written in C or Lua.

6 userdata

Represents arbitrary C data.

7 thread

Represents independent threads of execution and it is used to implement coroutines.

8 table

Represent ordinary arrays, symbol tables, sets, records, graphs, trees, etc., and implements associative arrays. It can hold any value (except nil).
#+end_quote

get value type
#+begin_src lua
print(type("What is my type"))   --> string
t = 10

print(type(5.8*t))               --> number
print(type(true))                --> boolean
print(type(print))               --> function
print(type(nil))                 --> nil
print(type(type(ABC)))           --> string
#+end_src

copy from [[https://www.tutorialspoint.com/lua/lua_data_types.htm][Lua - Data Types]]


** learn lua in x minutes
[[https://learnxinyminutes.com/docs/lua/][Learn Lua in Y minutes]]

[[https://learnxinyminutes.com/docs/zh-cn/lua-cn/][Y分钟速成Lua]]

** install packages via luarocks

#+begin_src sh
brew install luarocks
#+end_src

install  lpeg

#+begin_src sh
luarocks install lpeg
#+end_src

** ob-lua example
#+name: lua-hello-world
#+begin_src lua :results output :exports both
print 'Hello World!'
print ("Hello World!")
#+end_src

#+RESULTS: lua-hello-world
: Hello World!
: Hello World!


** skynet compile


#+begin_quote
https://stackoverflow.com/questions/43085652/link-error-with-undefined-lua-xxxxx-when-building-lsnes
https://blog.csdn.net/wc188996/article/details/114931760
https://blog.csdn.net/qq_38872258/article/details/114584331
#+end_quote

compile skynet on centos 7
#+begin_src shell
yum install centos-release-scl
yum install devtoolset-9-gcc* -y
scl enable devtoolset-9 bash
source scl_source enable devtoolset-9
echo 'source scl_source enable devtoolset-9' >> ~/.bashrc

sudo yum install -y readline-devel protobuf-compiler lua lua-devel automake autoconf libtool git vim
#+end_src

** syntax station

see [[https://syntaxstation.com/lua.html][lua]]
